In [1]:
import pandas as pd

In [4]:
a = {'a':[1,2,3], 'b':[1,3,5],'c':[2,4,6],'d':[3,6,9]}

In [5]:
a

{'a': [1, 2, 3], 'b': [1, 3, 5], 'c': [2, 4, 6], 'd': [3, 6, 9]}

In [6]:
df1 = pd.DataFrame(a)

In [7]:
df1

   a  b  c  d
0  1  1  2  3
1  2  3  4  6
2  3  5  6  9

In [8]:
type(df1)

pandas.core.frame.DataFrame

In [9]:
df1.shape

(3, 4)

In [11]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   a       3 non-null      int64
 1   b       3 non-null      int64
 2   c       3 non-null      int64
 3   d       3 non-null      int64
dtypes: int64(4)
memory usage: 224.0 bytes

In [12]:
import numpy as np

In [13]:
b = np.arange(12).reshape(3,4)

In [14]:
b

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11]])

In [15]:
df2=pd.DataFrame(b)

In [16]:
df2

   0  1   2   3
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11

In [17]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   0       3 non-null      int32
 1   1       3 non-null      int32
 2   2       3 non-null      int32
 3   3       3 non-null      int32
dtypes: int32(4)
memory usage: 176.0 bytes

In [19]:
df2.shape

(3, 4)

In [20]:
df = pd.DataFrame([[1,20,'서울'], [2,25,'대전']], 
                 index = ['홍길동','홍길순'],
                 columns = ['순서','나이','지역'])

In [21]:
df

     순서  나이  지역
홍길동   1  20  서울
홍길순   2  25  대전

In [22]:
type(df)

pandas.core.frame.DataFrame

In [23]:
df.shape

(2, 3)

In [24]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 2 entries, 홍길동 to 홍길순
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   순서      2 non-null      int64
 1   나이      2 non-null      int64
 2   지역      2 non-null      object
dtypes: int64(2), object(1)
memory usage: 64.0+ bytes

In [25]:
df.index

Index(['홍길동', '홍길순'], dtype='object')

In [26]:
df.values

array([[1, 20, '서울'],
       [2, 25, '대전']], dtype=object)

In [27]:
df.columns

Index(['순서', '나이', '지역'], dtype='object')

In [28]:
df.index = ['사람1','사람2']

In [30]:
df

     순서  나이  지역
사람1   1  20  서울
사람2   2  25  대전

In [31]:
df.columns = ['연번', '연령', '도시']

In [32]:
df

     연번  연령  도시
사람1   1  20  서울
사람2   2  25  대전

In [33]:
df = df.rename(index = {'사람1':'홍길동'})

In [34]:
df

     연번  연령  도시
홍길동   1  20  서울
사람2   2  25  대전

In [36]:
df=df.rename(columns = {'연번':'순서', '연령':'나이'})

In [37]:
df

     순서  나이  도시
홍길동   1  20  서울
사람2   2  25  대전

In [38]:
df.loc['사람3']=[3,30,'부산']

In [39]:
df

     순서  나이  도시
홍길동   1  20  서울
사람2   2  25  대전
사람3   3  30  부산

In [40]:
df.loc['사람4'] = 0

In [41]:
df

     순서  나이  도시
홍길동   1  20  서울
사람2   2  25  대전
사람3   3  30  부산
사람4   0   0   0

In [42]:
df.loc['사람1'] = df.loc['홍길동']

In [43]:
df

     순서  나이  도시
홍길동   1  20  서울
사람2   2  25  대전
사람3   3  30  부산
사람4   0   0   0
사람1   1  20  서울

In [44]:
df.loc[5]=0

In [45]:
df

     순서  나이  도시
홍길동   1  20  서울
사람2   2  25  대전
사람3   3  30  부산
사람4   0   0   0
사람1   1  20  서울
5     0   0   0

In [49]:
df

     순서  나이  도시
홍길동   1  20  서울
사람2   2  25  대전
사람3   3  30  부산
사람4   0   0   0
사람1   1  20  서울
5     0   0   0

In [51]:
df['나이대']=['20대','20대','30대','0대','20대','0대']

In [52]:
df

     순서  나이  도시  나이대
홍길동   1  20  서울  20대
사람2   2  25  대전  20대
사람3   3  30  부산  30대
사람4   0   0   0   0대
사람1   1  20  서울  20대
5     0   0   0   0대

In [53]:
df['직업'] = '학생'

In [54]:
df

     순서  나이  도시  나이대  직업
홍길동   1  20  서울  20대  학생
사람2   2  25  대전  20대  학생
사람3   3  30  부산  30대  학생
사람4   0   0   0   0대  학생
사람1   1  20  서울  20대  학생
5     0   0   0   0대  학생

In [55]:
df.loc[5,'순서'] = 6

In [56]:
df

     순서  나이  도시  나이대  직업
홍길동   1  20  서울  20대  학생
사람2   2  25  대전  20대  학생
사람3   3  30  부산  30대  학생
사람4   0   0   0   0대  학생
사람1   1  20  서울  20대  학생
5     6   0   0   0대  학생

In [59]:
df.iloc[3,1] = 10
df

     순서  나이  도시  나이대  직업
홍길동   1  20  서울  20대  학생
사람2   2  25  대전  20대  학생
사람3   3  30  부산  30대  학생
사람4   0  10   0   0대  학생
사람1   1  20  서울  20대  학생
5     6   0   0   0대  학생

In [60]:
df.loc['사람4',['도시','나이대']] = '광주','10대'

In [61]:
df

     순서  나이  도시  나이대  직업
홍길동   1  20  서울  20대  학생
사람2   2  25  대전  20대  학생
사람3   3  30  부산  30대  학생
사람4   0  10  광주  10대  학생
사람1   1  20  서울  20대  학생
5     6   0   0   0대  학생

In [62]:
df.loc[5,['나이', '도시']] = ["12",'강릉']

In [63]:
df

     순서  나이  도시  나이대  직업
홍길동   1  20  서울  20대  학생
사람2   2  25  대전  20대  학생
사람3   3  30  부산  30대  학생
사람4   0  10  광주  10대  학생
사람1   1  20  서울  20대  학생
5     6  12  강릉   0대  학생

In [64]:
df.loc[5] = df.loc['사람4']

In [65]:
df

     순서  나이  도시  나이대  직업
홍길동   1  20  서울  20대  학생
사람2   2  25  대전  20대  학생
사람3   3  30  부산  30대  학생
사람4   0  10  광주  10대  학생
사람1   1  20  서울  20대  학생
5     0  10  광주  10대  학생

In [66]:
df = df.rename(index={5:'홍길순'})
df

     순서  나이  도시  나이대  직업
홍길동   1  20  서울  20대  학생
사람2   2  25  대전  20대  학생
사람3   3  30  부산  30대  학생
사람4   0  10  광주  10대  학생
사람1   1  20  서울  20대  학생
홍길순   0  10  광주  10대  학생

In [67]:
df.iloc[3,0] = 4
df

     순서  나이  도시  나이대  직업
홍길동   1  20  서울  20대  학생
사람2   2  25  대전  20대  학생
사람3   3  30  부산  30대  학생
사람4   4  10  광주  10대  학생
사람1   1  20  서울  20대  학생
홍길순   0  10  광주  10대  학생

In [68]:
df.iloc[3,[1,3]]=40,'40대'

In [69]:
df

     순서  나이  도시  나이대  직업
홍길동   1  20  서울  20대  학생
사람2   2  25  대전  20대  학생
사람3   3  30  부산  30대  학생
사람4   4  40  광주  40대  학생
사람1   1  20  서울  20대  학생
홍길순   0  10  광주  10대  학생

In [70]:
df.iloc[5,0]=5
df

     순서  나이  도시  나이대  직업
홍길동   1  20  서울  20대  학생
사람2   2  25  대전  20대  학생
사람3   3  30  부산  30대  학생
사람4   4  40  광주  40대  학생
사람1   1  20  서울  20대  학생
홍길순   5  10  광주  10대  학생

In [71]:
df = df.rename(columns = {'순서': 'No.'})
df

     No.  나이  도시  나이대  직업
홍길동    1  20  서울  20대  학생
사람2    2  25  대전  20대  학생
사람3    3  30  부산  30대  학생
사람4    4  40  광주  40대  학생
사람1    1  20  서울  20대  학생
홍길순    5  10  광주  10대  학생

In [72]:
df.loc['사람1','No.'] = 6
df

     No.  나이  도시  나이대  직업
홍길동    1  20  서울  20대  학생
사람2    2  25  대전  20대  학생
사람3    3  30  부산  30대  학생
사람4    4  40  광주  40대  학생
사람1    6  20  서울  20대  학생
홍길순    5  10  광주  10대  학생

In [73]:
df.iloc[5,[1,3]]=50,'50대'
df

     No.  나이  도시  나이대  직업
홍길동    1  20  서울  20대  학생
사람2    2  25  대전  20대  학생
사람3    3  30  부산  30대  학생
사람4    4  40  광주  40대  학생
사람1    6  20  서울  20대  학생
홍길순    5  50  광주  50대  학생

In [74]:
df = df.drop('사람4', axis = 0)
df

     No.  나이  도시  나이대  직업
홍길동    1  20  서울  20대  학생
사람2    2  25  대전  20대  학생
사람3    3  30  부산  30대  학생
사람1    6  20  서울  20대  학생
홍길순    5  50  광주  50대  학생

In [75]:
df=df.drop(['나이대','직업'],axis=1)
df

     No.  나이  도시
홍길동    1  20  서울
사람2    2  25  대전
사람3    3  30  부산
사람1    6  20  서울
홍길순    5  50  광주

In [76]:
df2 = df
df2

     No.  나이  도시
홍길동    1  20  서울
사람2    2  25  대전
사람3    3  30  부산
사람1    6  20  서울
홍길순    5  50  광주

In [77]:
df2.loc['사람1','No'] = 4
df2

     No.  나이  도시   No
홍길동    1  20  서울  NaN
사람2    2  25  대전  NaN
사람3    3  30  부산  NaN
사람1    6  20  서울  4.0
홍길순    5  50  광주  NaN

In [78]:
df2.loc['사람1','No.'] = 4
df2

     No.  나이  도시   No
홍길동    1  20  서울  NaN
사람2    2  25  대전  NaN
사람3    3  30  부산  NaN
사람1    4  20  서울  4.0
홍길순    5  50  광주  NaN

In [80]:
df2=df2.drop('No', axis = 1)
df2

     No.  나이  도시
홍길동    1  20  서울
사람2    2  25  대전
사람3    3  30  부산
사람1    4  20  서울
홍길순    5  50  광주

In [85]:
df

     No.  나이  도시   No
홍길동    1  20  서울  NaN
사람2    2  25  대전  NaN
사람3    3  30  부산  NaN
사람1    4  20  서울  4.0
홍길순    5  50  광주  NaN

In [83]:
df3=df2.copy()

In [84]:
df3

     No.  나이  도시
홍길동    1  20  서울
사람2    2  25  대전
사람3    3  30  부산
사람1    4  20  서울
홍길순    5  50  광주

In [86]:
df3.loc['사람1','No.']= 5
df3

     No.  나이  도시
홍길동    1  20  서울
사람2    2  25  대전
사람3    3  30  부산
사람1    5  20  서울
홍길순    5  50  광주

In [87]:
df

     No.  나이  도시   No
홍길동    1  20  서울  NaN
사람2    2  25  대전  NaN
사람3    3  30  부산  NaN
사람1    4  20  서울  4.0
홍길순    5  50  광주  NaN

In [88]:
hong = df.loc['홍길동']
hong

No.      1
나이      20
도시      서울
No     NaN
Name: 홍길동, dtype: object

In [90]:
df = df.rename(columns = {'No.': '순서'})
df

     순서  나이  도시   No
홍길동   1  20  서울  NaN
사람2   2  25  대전  NaN
사람3   3  30  부산  NaN
사람1   4  20  서울  4.0
홍길순   5  50  광주  NaN

In [91]:
df = df.drop(['No'], axis=1)

In [92]:
df

     순서  나이  도시
홍길동   1  20  서울
사람2   2  25  대전
사람3   3  30  부산
사람1   4  20  서울
홍길순   5  50  광주

In [93]:
type(hong)

pandas.core.series.Series

In [94]:
hong.shape

(4,)

In [95]:
gil = df.iloc[0]
gil

순서     1
나이    20
도시    서울
Name: 홍길동, dtype: object

In [96]:
type(gil)

pandas.core.series.Series

In [97]:
gil.shape

(3,)

In [98]:
df4 = df.loc[['홍길동','사람1']]
df4

     순서  나이  도시
홍길동   1  20  서울
사람1   4  20  서울

In [99]:
type(df4)

pandas.core.frame.DataFrame

In [100]:
df5 = df.iloc[[0,3]]

In [101]:
df5

     순서  나이  도시
홍길동   1  20  서울
사람1   4  20  서울

In [102]:
df6=df.loc['홍길동':'사람3']

In [103]:
df6

     순서  나이  도시
홍길동   1  20  서울
사람2   2  25  대전
사람3   3  30  부산

In [104]:
df7=df.iloc[0:3]

In [105]:
df7

     순서  나이  도시
홍길동   1  20  서울
사람2   2  25  대전
사람3   3  30  부산

In [106]:
df

     순서  나이  도시
홍길동   1  20  서울
사람2   2  25  대전
사람3   3  30  부산
사람1   4  20  서울
홍길순   5  50  광주

In [107]:
df8 =df[['나이']]

In [109]:
df8

     나이
홍길동  20
사람2  25
사람3  30
사람1  20
홍길순  50

In [110]:
df9 =df['나이']

In [111]:
df9

홍길동    20
사람2    25
사람3    30
사람1    20
홍길순    50
Name: 나이, dtype: object

In [112]:
type(df8)

pandas.core.frame.DataFrame

In [113]:
type(df9)

pandas.core.series.Series

In [114]:
df10=df[['나이','도시']]

In [116]:
df10

     나이  도시
홍길동  20  서울
사람2  25  대전
사람3  30  부산
사람1  20  서울
홍길순  50  광주

In [118]:
df11 = df.loc[['홍길동','사람1'],['나이', '도시']]
df11

     나이  도시
홍길동  20  서울
사람1  20  서울

In [119]:
df12=df.iloc[[0,3],[1,2]]
df12

     나이  도시
홍길동  20  서울
사람1  20  서울